probe-acceleration/constant/transportProperties
FoamFile
{
    version     2.0;
    foamVersion 4.x;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

nu              [0 2 -1 0 0 0 0] 0.01;

// vi: set ft=foam et sw=4 ts=4:
